/*****************************************************************//**
 * \file   ScriptText.cpp
 * \brief  テキスト情報
 *
 * \author 齋藤 瑚羽
 * \date   August 2023
 *********************************************************************/
 
#include "ScriptText.h"

//シナリオ用の画像番号とボイスの名前とテキスト

struct SCRIPT talk[TALK_SCENE_MAX][LINE_MAX] = {
	{//プロローグエリアシナリオ①　ゲームスタート時再生    
		{  0, 0, 0, 6, 1, 2, 1, "res/voice/voice/vc1.wav" , "シリウス、呼んだ？"},
		{  0, 0, 0, 8, 0, 2, 3, "res/voice/voice/vc2.wav" , "遅い。呼んだら直ぐに来い。戦場では１秒の遅れが死を招く"},
		{  0, 0, 0, 6, 0, 2, 1, "res/voice/voice/vc3.wav" , "……わかった？"},
		{  0, 0, 0, 7, 0, 2, 3, "res/voice/voice/vc4.wav" , "お前は相変わらずだな。まぁいい。今回のミッションについて説明する"},
		{  0, 0, 0, 8, 0, 2, 3, "res/voice/voice/vc5.wav" , "本作戦の目的は、太陽系に突如出現した人工物の調査だ"},
		{  0, 0, 0, 6, 0, 2, 3, "res/voice/voice/vc6.wav" , "シンギュラリティ反応が強く、内部の情報は分からない"},
		{  0, 0, 0, 8, 0, 2, 3, "res/voice/voice/vc7.wav" , "適正の高いお前にしかできない任務だ。 \n何が起こるか分からないから心しておけ"},
		{  0, 0, 0, 8, 1, 2, 1, "res/voice/voice/vc8.wav" , "うん"},
		{ 11, 0, 3, 6, 1, 2, 5, "res/voice/voice/vc9.wav" , "あら、フェリスちゃんおはよう"},
		{ 10, 0, 3, 6, 1, 2, 4, "res/voice/voice/vc10.wav" , "今回の作戦では私がオペレーターを務めます。よろしくね"},
		{ 13, 1, 3, 6, 1, 2, 1, "res/voice/voice/vc11.wav" , "よろしく"},
		{ 12, 1, 3, 8, 0, 2, 3, "res/voice/voice/vc12.wav" , "よし。では出撃の準備にかかれ"},
		{ 13, 1, 3, 6, 1, 2, 1, "res/voice/voice/vc13.wav" , "わかった。行ってくる" , },
		{ 10, 0, 3, 6, 1, 2, 4, "res/voice/voice/vc14.wav" , "頑張ってね！　フェリスちゃん！" },
		{ 13, 1, 3, 9, 0, 2, 3, "res/voice/voice/vc15.wav" , "必ず帰ってこい"},
		{ -1}
	},
	{//プロローグエリアシナリオ②　ステージ１侵入後再生
		{ 0, 0, 0, 11, 0, 3, 4, "res/voice/voice/vc16.wav" , "……もしもし？　フェリスちゃん聞こえる？"  },
		{ 0, 0, 0, 11, 1, 3, 1, "res/voice/voice/vc17.wav" , "聞こえるよ" },
		{ 0, 0, 0, 10, 0, 3, 4, "res/voice/voice/vc18.wav" , "良かった。ひとまずは安心ね。何か困ったことはない？" },
		{ 0, 0, 0, 13, 0, 3, 1, "res/voice/voice/vc19.wav" , "通常武器以外の弾薬が消えた" },
		{ 0, 0, 0, 11, 0, 3, 4, "res/voice/voice/vc20.wav" , "あらら。強いシンギュラリティ反応による歪みの影響かしら \nこうなると、専用のカートリッジを現地調達するしかないわね" },
		{ 0, 0, 0, 12, 0, 3, 4, "res/voice/voice/vc21.wav" , "うーん……そうね、反射武器用のカートリッジはその先にあるみたい。 \n軌道エレベーターの近くかしら" },
		{ 0, 0, 0, 10, 0, 3, 1, "res/voice/voice/vc22.wav" , "わかった。向かう"},
		{ 0, 0, 0, 11, 0, 3, 4, "res/voice/voice/vc23.wav" , "防衛システムが作動してるみたいだから、気を付けてね"},
		{ -1, 0, 0, 0, 0, 0, 4}
	},
	{//プロローグエリアシナリオ③　ステージ３侵入後再生
		{ 10, 0, 3, 6, 0, 2, 4, "res/voice/voice/vc24.wav" , "そういえば、大佐ってお子さんがいらっしゃるんですか？"},
		{ 13, 1, 3, 7, 0, 2, 3, "res/voice/voice/vc25.wav" , "娘がいた。色々あってしばらくあってない"},
		{ 11, 0, 3, 9, 0, 2, 4, "res/voice/voice/vc26.wav" , "……今の質問は忘れてください"},
		{ 11, 1, 3, 8, 0, 2, 3, "" , "……"},
		{ -1, 0, 0, 0, 0, 0, 4}
	},
	//{//プロローグエリア踏破後シナリオ
	//	{ 0, 0, 0, 0, 0, 0, 0, "" , "――データベース開示―― \n居住区連邦情報部"},
	//	{ 0, 0, 0, 0, 0, 0, 0, "" , "フェリスが所属している組織で \n外宇宙に点在する軌道上居住区において公安活動を行っている \n強力な武器の携帯を許可されている政府直属の特殊部隊"},
    //  {-1}
	//},
	{//市街地エリアシナリオ①　ステージ５侵入後再生
		{ 10, 0, 3, 0, 0, 0, 4, "res/voice/voice/vc27.wav" , "地上の街に着いたみたいね。 \n配管のある路地裏から地下へ侵入できるはずだから、 \nまずはそこへ向かいましょう"},
		{  0, 0, 0, 1, 1, 1, 5, "" , "……"},
		{  0, 0, 0, 4, 0, 1, 5, "res/voice/voice/vc28.wav" , "……やっと会えましたね。とても長い間、お待ちしておりました"},
		{  0, 0, 0, 1, 0, 1, 1, "res/voice/voice/vc29.wav" , "誰？"},
		{  0, 0, 0, 4, 0, 1, 5, "res/voice/voice/vc30.wav" , "……私は、アトリアといいます"},
		{  0, 0, 0, 4, 0, 1, 1, "res/voice/voice/vc31.wav" , "アトリアはここの住民？"},
		{  0, 0, 0, 2, 0, 1, 2, "res/voice/voice/vc32.wav" , "ええ、そうですよ"},
		{  0, 0, 0, 2, 0, 1, 1, "res/voice/voice/vc33.wav" , "この軌道上居住区は何？"},
		{  0, 0, 0, 4, 0, 1, 2, "res/voice/voice/vc34.wav" , "ここは、……過去と未来の中継地点"},
		{  0, 0, 0, 4, 1, 1, 1, "" , "……？"},
		{  6, 0, 2, 0, 0, 0, 3, "res/voice/voice/vc35.wav" , "どうした？　そこに誰かいるのか？"},
		{  0, 0, 0, 0, 0, 0, 1, "" , "……？"},
		{ -1, 0, 0, 0, 0, 0, 2}
	},
	{
	    { -1, 0, 0, 0, 0, 0, 2}
	},
	{//地下エリアシナリオ②　ステージ７侵入後再生
		{  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc42.wav" , "……世界は今、夢を見ているだけ"},
		{  0, 0, 0, 3, 0, 1, 1, "res/voice/voice/vc43.wav" , "うん？"},
		{  0, 0, 0, 2, 0, 1, 2, "res/voice/voice/vc44.wav" , "……ここからは地下エリアです \n無線は繋がらないので、私が案内しましょう"},
		{ -1, 0, 0, 0, 0, 0, 3}
	},
	{//地下エリアシナリオ①　ステージ９侵入後再生
		{ 10, 1, 3, 8, 0, 2, 3, "res/voice/voice/vc36.wav" , "人工物の正体は破棄された軌道上居住区なのか？"},
		{ 11, 0, 3, 8, 1, 2, 4, "res/voice/voice/vc37.wav" , "報告を聞く限りそのようです"},
		{ 11, 1, 3, 6, 0, 2, 3, "res/voice/voice/vc38.wav" , "ふむ、識別番号からどこのコロニーか割り出せるか？"},
		{ 10, 0, 3, 6, 1, 2, 4, "res/voice/voice/vc39.wav" , "はい、少々お待ちください"},
		{ 10, 1, 3, 8, 1, 2, 3, "" , "…………"},
		{ 11, 0, 3, 8, 0, 2, 4, "res/voice/voice/vc40.wav" , "……第１７、軌道上居住区……です……"},
		{ 11, 1, 3, 9, 0, 2, 3, "res/voice/voice/vc41.wav" , "……そうか"},
		{ -1, 0, 0, 0, 0, 0, 1}
	},
	{//研究所エリアシナリオ①　ステージ１１侵入後再生
		{  0, 0, 0, 3, 0, 1, 1, "res/voice/voice/vc45.wav" , "この研究所は一体？"},
		{  0, 0, 0, 2, 0, 1, 2, "res/voice/voice/vc46.wav" , "ここは、シンギュラリティ研究所です"},
		{  0, 0, 0, 1, 0, 1, 1, "res/voice/voice/vc47.wav" , "……禁止された研究"},
		{  0, 0, 0, 4, 0, 1, 2, "res/voice/voice/vc48.wav" , "そう。地上の建造物はこの施設をカモフラージュするために存在しています"},
		{ -1, 0, 0, 0, 0, 0, 1}
	},
    {//時計の街エリアシナリオ①　ステージ１4侵入後再生
        {  0, 0, 0, 2, 0, 1, 1, "res/voice/voice/vc49.wav" , "……異質な空間"},
        {  0, 0, 0, 4, 0, 1, 2, "res/voice/voice/vc50.wav" , "ここは時計の街。幾千年もの間、誰も踏み入ったことのない聖域です"},
        {  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc51.wav" , "……キミの記憶は失ったのではなく、 \n”預けた”という表現が正しいのかもしれません"},
        {  0, 0, 0, 2, 0, 1, 1, "res/voice/voice/vc52.wav" , "どういうこと？"},
        {  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc53.wav" , "……すぐに分かりますよ"},
	    { -1, 0, 0, 0, 0, 0, 2}
    },
	{//時計の街エリアシナリオ②　ステージ１７侵入後再生
        {  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc54.wav" , "……この場所で、全てが始まりました"},
        {  0, 0, 0, 2, 0, 1, 2, "res/voice/voice/vc55.wav" , "未来に進みたいなら、――時の守護者を倒して"},
	    { -1, 0, 0, 0, 0, 0, 2}
	},
	{//ボス戦クリア後シナリオ
		{  0, 0, 0, 3, 0, 1, 2, "", "……！"},
		{  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc56.wav", "……これで世界は、再び時を刻み始めました"},
		{  0, 0, 0, 4, 0, 1, 2, "", "……"},
		{  0, 0, 0, 1, 0, 1, 2, "res/voice/voice/vc57.wav", "フェリス、家族に会いたい？"},
		{  0, 0, 0, 4, 0, 1, 1, "res/voice/voice/vc8.wav", "うん"},
		{  0, 0, 0, 5, 0, 1, 2, "res/voice/voice/vc58.wav", "わかった。私の記憶、全部キミに渡すね"},
		{  0, 0, 0, 5, 1, 1, 1, "res/voice/voice/vc59.wav", "……え？"},
		{  0, 0, 0, 5, 0, 1, 2, "res/voice/voice/vc60.wav", "……最後にお話しできてすごく楽しかったよ \nありがとう。――”未来の私”"},
		{  0, 0, 0, 0, 0, 0, 1, "res/voice/voice/vc61.wav", "――！！  ちょっとまって！"},
		{  0, 0, 0, 0, 0, 0, 1, "", "…………"},
		{  0, 0, 0, 0, 0, 0, 1, "res/voice/voice/vc62.wav", "……アト……リア……"},
		{  0, 0, 0, 8, 0, 2, 3, "res/voice/voice/vc63.wav", "フェリス！  ――聞こえているのかフェリス！！"},
		{  0, 0, 0, 8, 1, 2, 1, "", "…………"},
		{  0, 0, 0, 8, 1, 2, 1, "res/voice/voice/vc64.wav", "……聞こえていますよ、”お父様”"},
		{  0, 0, 0, 9, 0, 2, 3, "", "……"},
		{  0, 0, 0, 7, 0, 2, 3, "res/voice/voice/vc65.wav", "……戻ったのか、……記憶が"},
		{  0, 0, 0, 9, 0, 2, 1, "res/voice/voice/vc66.wav", "……ええ。帰ったらお話ししますね \n長い長い、――追憶の物語を"},
		{ -2}
	}
};

struct TUTORIAL tutorial[TALK_SCENE_MAX][LINE_MAX] = {
	{
		{ 0,0},
		{ 0,1},
		{ 0,2},
		{ 0,3},
		{ 0,4},
		{-1,4}
	},
	{
		{ 0,5},
		{ 0,6},
		{ 0,7},
		{ 0,8},
		{ 0,9},
	    {-1,9}
	},
	{
		{ 0,10},
		{ 0,11},
		{ 0,12},
		{ 0,13},
		{ 0,14},
		{-1,14}
	},
	{
		{ 0,15},
		{ 0,16},
		{ 0,17},
		{ 0,18},
		{ 0,19},
		{-1,19}
	},
	{
		{ 0,20},
		{ 0,21},
		{-1,21}
	},
	{
		{ 0,22},
		{ 0,23},
		{-1,23}
	},
    {
		{ 0,24},
	    {-1,24}
	}
};
